# ViewShapeBuilder Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewShapeBuilder Class
Members See Also
---
Builds and verifies a view-specific shape representation that would typically be stored in a DirectShape object. Currently limited to curve-based representations for plan and elevation views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class ViewShapeBuilder : ShapeBuilder
```

Visual Basic
---
```text
Public Class ViewShapeBuilder _
	Inherits ShapeBuilder
```

Visual C++
---
```text
public ref class ViewShapeBuilder : public ShapeBuilder
```

# Remarks
The validation functionality is used by DirectShape to validate the incoming shape.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ShapeBuilder Autodesk.Revit.DB..::..ViewShapeBuilder
# See Also
ViewShapeBuilder Members
Autodesk.Revit.DB Namespace